<template>
    <div class="ProductCardDescr">
        <div class="ProductCardDescr__block">
            <h2>Теплица Salisbury с тамбуром</h2>
            <h3>Размер</h3>
            <p>
                Ширина теплицы – 2,98 метра.
                Длина – 4,02м, 6,02м, 8,02м и более, кратно 2 метрам.
                Данные размеры соответствуют размерам фундамента по внешнему краю.
                Высота теплицы - 2,15 метра.
                Высота указана с учетом фундамента из бруса 150х100.
            </p>

            <h3>Каркас</h3>
            <p>
                Теплица имеет две двери и две форточки в противоположных торцах.
                Каркас выполнен из оцинкованной квадратной трубы 20х20, расстояние между дугами - 1 м или 0,65 м.
                Благодаря оцинкованному каркасу теплица крайне устойчива к ржавчине и не требует подкрасов во время эксплуатации (в отличие от теплиц, покрашенных грунт-эмалью).
            </p>

            <h3>
                Крепление поликарбоната
            </h3>
            <p>
                Усиленное крепление поликарбоната, кровельными саморезами с резиновой пресс шайбой через оцинкованную ленту. Такое крепление:
                1) Предотвращает отрыв и повреждение поликарбоната под действием сильного ветра и снеговой шапки;
                2) Надежно прижимает поликарбонат по всей длине дуги теплицы оцинкованной лентой. Ваш поликарбонат не будет летать по огороду соседей;
                3) Позволяет избегать случайного перетягивания и продавливания поликарбоната саморезом при монтаже.
                Для теплицы с шагом дуг 1 м крепление поликарбоната - кровельными саморезами.
            </p>

            <h3>
                Комплектация
            </h3>
            <p>
                Теплица имеет две форточки и две двери в противоположных торцах.
                Дополнительно Вы можете приобрести самооткрывающиеся (в зависимости от температуры) автоматические форточки.
                Вся необходимая фурнитура для сборки каркаса теплицы и крепления поликарбоната в комплекте.
            </p>

            <h3>
                Особенности
            </h3>
            <p>
                Для теплицы с шагом дуг 1 м требуется регулярный уход в виде очистки от выпавшего снега.
                Увеличенное количество дуг с шагом 0,65 м позволяет выдерживать более значительные нагрузки, чем с шагом 1 м, но в снежных регионах уход за такой теплицей также необходим.
            </p>

            <h3>
                Монтаж
            </h3>
            <p>
                Минимальное количество разборных элементов обеспечивает легкость сборки, поэтому 95% покупателей устанавливают теплицу самостоятельно.
                Наша компания настоятельно рекомендует устанавливать теплицу на брус 150х100, 100х100.
                Использование в качестве фундамента бруса меньшего сечения, например, доски 100х50, не рекомендуется даже в целях крайней экономии.
                Перед самостоятельной сборкой теплицы Вы можете посмотреть видеоинструкцию на нашем сайте внизу страницы.
                Подробный печатный вариант инструкции идет в комплекте с каждой теплицей.
                Ориентировочное время монтажа теплицы - 3 часа.
            </p>
        </div>
    </div>
</template>

<script setup lang="ts">

</script>

<style scoped lang="scss">
.ProductCardDescr {
    &__block {

        & h2 {
            margin-top: 16px;
            font-weight: 600;
            font-size: 24px;
            line-height: 140%;
            color: #141414;
        }

        & h3 {
            margin-top: 16px;
            font-weight: 600;
            font-size: 20px;
            line-height: 140%;
            color: #141414;
        }

        & p {
            margin-top: 8px;
            font-size: 14px;
            line-height: 140%;
        }
    }
}
</style>